In [1]:
import pandas as pd # Dataframe operations

**creat dataframes using Dictionary**

**step-1**

**creat dataframe**

In [2]:
d1={"NAME":['jeeshan','abrar','ahmad'],
"AGE":[20,25,30]}
pd.DataFrame(d1)

      NAME  AGE
0  jeeshan   20
1    abrar   25
2    ahmad   30

In [3]:
d1={"NAME":['jeeshan','abrar','ahmad'],
"AGE":[20,25,30]}
#providing index
ind=['A','B','C']
pd.DataFrame(d1,index=ind)

      NAME  AGE
A  jeeshan   20
B    abrar   25
C    ahmad   30

In [4]:
#Adding new column
cityname=['satna','patna','hyd']
d1['CITY']=cityname
pd.DataFrame(d1,index=ind)

      NAME  AGE   CITY
A  jeeshan   20  satna
B    abrar   25  patna
C    ahmad   30    hyd

In [12]:
#update the exsisting column
d1['NAME']=['junaid','feroz','turab']
pd.DataFrame(d1,index=ind)

     NAME  AGE   CITY
A  junaid   20  satna
B   feroz   25  patna
C   turab   30    hyd

In [13]:
#drop the column
df=pd.DataFrame(d1,index=ind)
df.drop(['CITY'],axis=1,inplace=True)
df

     NAME  AGE
A  junaid   20
B   feroz   25
C   turab   30

In [14]:
#drop the row
df.drop(['C'],axis=0,inplace=True)
df

     NAME  AGE
A  junaid   20
B   feroz   25

In [15]:
#save the dataframe
df.to_csv("assingment_df.csv")
df.to_excel("assingment_df.xlsx")

In [16]:
# read output csv
pd.read_csv("assingment_df.csv")

  Unnamed: 0    NAME  AGE
0          A  junaid   20
1          B   feroz   25

In [17]:
# To avoid the above problem
# give index=Falsedf.to_csv("assingment_df.csv",index=False)
df.to_csv("assingment_df.csv",index=False)

In [18]:
pd.read_csv("assingment_df.csv")

     NAME  AGE
0  junaid   20
1   feroz   25